{
    "url": "https://www.target.com/p/good-humor-strawberry-shortcake-frozen-dessert-bars-6pk/-/A-13493042",
    "tcin": "13493042",
    "upc": "041000053153",
    "price_amount": 5.49,
    "currency": "USD",
    "description": "Good Humor Strawberry Shortcake Frozen Dairy Dessert Bar combines creamy vanilla flavored frozen dessert with a luscious strawberry core—then coats the whole thing in our signature strawberry shortcake cake coating. If you love vanilla and strawberry ice cream, then our Strawberry Shortcake Bar is sure to bring you heartfelt joy. The dairy in our delicious Strawberry Shortcake Frozen Dairy Dessert Bar is certified kosher. This classic frozen dessert will remind you to savor simple moments of joy, with its nostalgic flavors reminding you of the sound of ice cream truck bells growing louder as the truck rounded the corner. It doesn’t matter if you’re 9 or 99; Good Humor frozen treats transport you to a brighter, sunnier place where all the serious stuff of life seems to, well, melt away.Good Humor is the taste of America. Our product philosophy celebrates the classic flavors and dessert formats that Americans have grown to love. Originally inspired by classics like strawberry shortcake, we use dessert inspiration to reimagine frozen treat versions of America’s favorites. We know that ice cream is fun for families, and we develop products that feature tastes and textures that appeal to everyone in the family — in doing so, we want to help bring families together. Kids might love a classic ice cream cone or frozen dessert bar, while parents look for an indulgent cookie sandwich. Whatever the cravings, we have something for everyone.",
    "specs": null,
    "ingredients": [
        "ingredients: nonfat milk, cake crunch (bleached wheat flour, sugar, palm oil, salt, baking soda, artificial flavor, soybean oil, fd&c red 40 lake, soy lecithin), water, corn syrup, soybean oil, palm oil, sugar, fructose, coconut oil, less than 2% of: water, strawberry puree, whey, coconut, mono and diglycerides, citric acid, guar gum, natural and artificial flavors, locust bean gum, tara gum, red 40, salt, polysorbate 80, red 3, caramel color."
    ],
    "bullets": "Good Humor Strawberry Shortcake Frozen Dairy Dessert Bar is a delicious combination of a creamy vanilla frozen dairy dessert and a strawberry core with a signature cake coating.\nAmerica's favorite strawberry shortcake bar, this strawberry dessert is a delicious dessert for any time.\nThis classic frozen treat is covered with Good Humor's signature strawberry shortcake cake coating.\nThere are six frozen dessert bars in each box, making this the perfect treat for sharing with friends and family.\nThe dairy in our delicious Strawberry Shortcake Frozen Dairy Dessert Bar is certified kosher.\nGood Humor has been creating great tasting, high-quality ice cream and frozen dessert for the family since 1920.",
    "features": [
        "Contains: Soy, Milk, Coconut, Wheat",
        "Form: Bar",
        "Package Quantity: 6",
        "Net weight: 18 fl oz (US)"
    ]
}