{
    "url": "https://www.target.com/p/baby-trend-expedition-race-tec-jogger-travel-system-8211-ultra-gray/-/A-79344798",
    "tcin": "79344798",
    "upc": "090014028541",
    "price_amount": 279.99,
    "currency": "USD",
    "description": "The Baby Trend® Expedition® Race Tec™ Jogger provides comfort, quality, and style for you and your little one. Mom and dad will enjoy Parent Premiums with the ergonomic rubber handlebar, extra-large basket with wide opening to hold key essentials, and the modern designed parent console with cell phone positioner and two deep cup holders.Your child will appreciate the large UPF 50+ canopy shade with extended sun visor, 5-point safety harness with comfort shoulder strap covers, and 2 cup holders on the child tray. The padded seat also allows multiple reclining positions to ensure comfort and smooth rides.Our Expedition® Race Tec™ Jogger implements upgraded quick release front wheel that provides stability and safety when you jog. Now with this wheel design and the raised rubber handlebar, you and your little one can decide either you want to go off the beaten path or a quick morning jog. The trigger fold also makes the storage and transport much easier.Turn the Jogger into a travel system by combining the jogger with the included Ally™ 35 Infant Car Seat. The Ally™ features higher, deeper side wings with EPS foam for optimal side impact protection, a 5-point safety harness and a 4-position height adjustable base. It accepts infants from 4-35 lbs.",
    "specs": null,
    "ingredients": [],
    "bullets": "Suggested Age: Newborn to 5 years\nCar Seat Stage: Rear-facing from 4-35 pounds and up to 32 inches\nCar Seat Safety Features: Recline leveling system with dual bubble level indicators, 5-Point Adjustable Harness with one-hand adjustment, 6-position crotch belt adjustment, EPS Energy absorbing foam\nStroller Seat Adjustments: Comfort Cabin with extra-large UPF 50+ canopy with extended sun visor and Peek-A-Boo window.  Enhanced quick release front wheel for improved stability and safety (Upgrade wheel design compared to our Cityscape Jogger, Pathway Jogger, and Expedition Jogger)\nIncludes: RaceTec Jogger Stroller and car seat combination, Ally™ Infant Car Seat and Base, and extra-large basket with rear access to hold parent’s key essentials\nIncludes:  Modern designed parent console with cell phone positioner and 2 deep cup holders.  Swing away child tray with 2 cup holders makes getting child in and out of the stroller easily",
    "features": [
        "Dimensions (Overall): 41 Inches (H) x 24 Inches (W) x 48 Inches (D)",
        "Weight: 24.92 Pounds",
        "Dimensions (Collapsed): 18 Inches (H) x 24 Inches (W) x 36 Inches (D)",
        "Suggested Age: 0-5 Years",
        "Front Wheel Diameter: 12 Inches",
        "Rear Wheel Diameter: 16 Inches",
        "Features: Infant Car Seat Compatible, Adjustable Handle, LATCH Compatible",
        "Min. Carseat Weight Supported: 4 Pounds",
        "Max. Stroller Weight Capacity: 50 Pounds",
        "Max. Carseat Weight Capacity: 35 Pounds",
        "Assembly Details: Adult Assembly Required, Tools Not Provided",
        "Includes: Car Seat Base",
        "Product Configuration: Single",
        "Industry or Government Certifications: JPMA Certified",
        "Tire Type: EVA",
        "Material: Metal, Plastic, Polyester",
        "Battery: No Battery Used",
        "Care & Cleaning: Spot or Wipe Clean",
        "Warranty: 1 Year Limited Warranty. To obtain a copy of the manufacturer's or supplier's warranty for this item prior to purchasing the item, please call Target Guest Services at 1-800-591-3869"
    ]
}